BellerageHackathon/src/Enums/СтатусыСообщенийОбмена/СтатусыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщенийОбмена</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПовтора</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Подтверждено</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>НеобрабатываемаяОшибка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыПроверкиОтвета/СтатусыПроверкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиОтвета</name>
  <enumValues>
    <name>НеПроверен</name>
  </enumValues>
  <enumValues>
    <name>Правильный</name>
  </enumValues>
  <enumValues>
    <name>Неправильный</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРучнойПроверки</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыТестов/СтатусыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Documents/РезультатПопытки/РезультатПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатПопытки</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПопытки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РевизияРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНазначения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.КандидатыВнешние</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКандидатаСнимок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшВерсииТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗавершения</name>
    <type>
      <types>EnumRef.СпособыЗавершенияПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверки</name>
    <type>
      <types>EnumRef.СтатусыПроверкиПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПрохождения</name>
    <type>
      <types>EnumRef.РезультатыПрохождения</types>
    </type>
  </attributes>
  <attributes>
    <name>НабраноБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПравильныхОтветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллСнимок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшИсходногоСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходноеСообщение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВопросВерсии</name>
      <type>
        <types>CatalogRef.ВопросыВерсийТестов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВопросаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтветаСнимок</name>
      <type>
        <types>EnumRef.ТипыОтветов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовыйОтвет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветДан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПроверки</name>
      <type>
        <types>EnumRef.СтатусыПроверкиОтвета</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПравильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НабраноБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПроверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаВерсии</name>
      <type>
        <types>CatalogRef.ВариантыОтветовВерсий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторВерсииВарианта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВариантаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BellerageHackathon/src/Catalogs/Тесты/Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тесты</name>
  <attributes>
    <name>ИдентификаторТеста</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпубликованнаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАрхивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаАрхивации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Catalogs/СообщенияОбмена/СообщенияОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СообщенияОбмена</name>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыСообщенийОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообщенийОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКорреляции</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСущности</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейПопытки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейПопытки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшПолезнойНагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолезнаяНагрузка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодHTTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Catalogs/ВерсииТестов/ВерсииТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииТестов</name>
  <owners>Catalog.Тесты</owners>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВерсии</name>
    <type>
      <types>EnumRef.СтатусыВерсийТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТеста</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитВремениМинуты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемыОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПубликации</name>
    <type>
      <types>DocumentRef.ПубликацияТеста</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Catalogs/ВариантыОтветовВерсий/ВариантыОтветовВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтветовВерсий</name>
  <owners>Catalog.ВопросыВерсийТестов</owners>
  <attributes>
    <name>ИдентификаторВарианта</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсииВарианта</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВарианта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Правильный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/CommonModules/РабочееМестоТестированияСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СоздатьТест(Наименование = "Новый тест") Экспорт
    НачатьТранзакцию();
    Попытка
        Тест = Справочники.Тесты.СоздатьЭлемент();
        Тест.Заполнить(Неопределено);
        Тест.Наименование = Наименование;
        Тест.Записать();
        СоздатьЧерновикВТранзакции(Тест.Ссылка);
        ЗафиксироватьТранзакцию();
        Возврат Тест.Ссылка;
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецФункции

Функция СоздатьЧерновик(Тест) Экспорт
    НачатьТранзакцию();
    Попытка
        ЗаблокироватьТест(Тест);
        Результат = СоздатьЧерновикВТранзакции(Тест);
        ЗафиксироватьТранзакцию();
        Возврат Результат;
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецФункции

Функция СкопироватьТест(Источник) Экспорт
    НачатьТранзакцию();
    Попытка
        ЗаблокироватьТест(Источник);
        НовыйТест = Справочники.Тесты.СоздатьЭлемент();
        НовыйТест.Заполнить(Неопределено);
        НовыйТест.Наименование = Лев(Источник.Наименование + " (копия)", 150);
        НовыйТест.Записать();
        ВерсияИсточник = Источник.РабочаяВерсия;
        Если Не ЗначениеЗаполнено(ВерсияИсточник) Тогда
            ВерсияИсточник = Источник.ОпубликованнаяВерсия;
        КонецЕсли;
        СоздатьЧерновикВТранзакции(НовыйТест.Ссылка, ВерсияИсточник, Истина);
        ЗафиксироватьТранзакцию();
        Возврат НовыйТест.Ссылка;
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецФункции

Процедура ЗаблокироватьТест(Тест) Экспорт
    Если Не ЗначениеЗаполнено(Тест) Тогда
        ВызватьИсключение "Не выбран тест.";
    КонецЕсли;
    Блокировка = Новый БлокировкаДанных;
    Элемент = Блокировка.Добавить("Справочник.Тесты");
    Элемент.УстановитьЗначение("Ссылка", Тест);
    Блокировка.Заблокировать();
КонецПроцедуры

Функция СледующийПорядок(ИмяСправочника, Владелец) Экспорт
    Если ИмяСправочника = "ВопросыВерсийТестов" Тогда
        ПолеПорядка = "ПорядокВВерсии";
    ИначеЕсли ИмяСправочника = "ВариантыОтветовВерсий" Тогда
        ПолеПорядка = "Порядок";
    Иначе
        ВызватьИсключение "Неподдерживаемый справочник.";
    КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ ЕСТЬNULL(МАКСИМУМ(" + ПолеПорядка
        + "), 0) + 1 КАК Порядок ИЗ Справочник." + ИмяСправочника
        + " ГДЕ Владелец = &Владелец");
    Запрос.УстановитьПараметр("Владелец", Владелец);
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
    Возврат Выборка.Порядок;
КонецФункции

Функция СписокПодчиненных(ИмяСправочника, Владелец) Экспорт
    Если ИмяСправочника = "ВерсииТестов" Тогда
        Поля = "Ссылка, НомерВерсии, НаименованиеТеста, СтатусВерсии, ДатаПубликации";
        Порядок = "НомерВерсии УБЫВ";
    ИначеЕсли ИмяСправочника = "ВопросыВерсийТестов" Тогда
        Поля = "Ссылка, ПорядокВВерсии, ТекстВопроса, ТипОтвета, МаксимальныйБалл";
        Порядок = "ПорядокВВерсии";
    ИначеЕсли ИмяСправочника = "ВариантыОтветовВерсий" Тогда
        Поля = "Ссылка, Порядок, ТекстВарианта, Правильный";
        Порядок = "Порядок";
    Иначе
        ВызватьИсключение "Неподдерживаемый справочник.";
    КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ " + Поля + " ИЗ Справочник." + ИмяСправочника
        + " ГДЕ Владелец = &Владелец И НЕ ПометкаУдаления УПОРЯДОЧИТЬ ПО " + Порядок);
    Запрос.УстановитьПараметр("Владелец", Владелец);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ПовторитьСообщение(СсылкаСообщения) Экспорт
    НачатьТранзакцию();
    Попытка
        Блокировка = Новый БлокировкаДанных;
        Элемент = Блокировка.Добавить("Справочник.СообщенияОбмена");
        Элемент.УстановитьЗначение("Ссылка", СсылкаСообщения);
        Блокировка.Заблокировать();
        Объект = СсылкаСообщения.ПолучитьОбъект();
        Если Объект.Статус <> Перечисления.СтатусыСообщенийОбмена.ОжидаетПовтора
            И Объект.Статус <> Перечисления.СтатусыСообщенийОбмена.НеобрабатываемаяОшибка
            И Объект.Статус <> Перечисления.СтатусыСообщенийОбмена.Карантин Тогда
            ВызватьИсключение "Повтор доступен только для сообщения с ошибкой.";
        КонецЕсли;
        Объект.Статус = Перечисления.СтатусыСообщенийОбмена.Новое;
        Объект.КоличествоПопыток = 0;
        Объект.ДатаСледующейПопытки = ТекущаяДатаСеанса();
        Объект.Записать();
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры

Процедура ПроверитьОтветВручную(Результат, ИдентификаторОтвета, Принят, Комментарий) Экспорт
    НачатьТранзакцию();
    Попытка
        Блокировка = Новый БлокировкаДанных;
        Элемент = Блокировка.Добавить("Документ.РезультатПопытки");
        Элемент.УстановитьЗначение("Ссылка", Результат);
        Блокировка.Заблокировать();
        Документ = Результат.ПолучитьОбъект();
        Ответы = Документ.Ответы.НайтиСтроки(Новый Структура("ИдентификаторОтвета", ИдентификаторОтвета));
        Если Ответы.Количество() <> 1 Тогда ВызватьИсключение "Ответ не найден."; КонецЕсли;
        Ответ = Ответы[0];
        Если Ответ.СтатусПроверки <> Перечисления.СтатусыПроверкиОтвета.ОжидаетРучнойПроверки Тогда
            ВызватьИсключение "Ответ уже проверен или не требует ручной проверки.";
        КонецЕсли;
        Ответ.ОтветПравильный = Принят;
        Ответ.НабраноБаллов = ?(Принят, Ответ.МаксимальныйБалл, 0);
        Ответ.СтатусПроверки = ?(Принят, Перечисления.СтатусыПроверкиОтвета.Правильный,
            Перечисления.СтатусыПроверкиОтвета.Неправильный);
        Ответ.КомментарийПроверки = Комментарий;
        Документ.Записать();
        Итог = РасчетРезультатовТестовСервер.РассчитатьИтогПоОтветам(Документ.Ответы, Документ.ПроходнойБаллСнимок);
        Если Не Итог.ЕстьОжидающиеПроверки Тогда
            РасчетРезультатовТестовСервер.ЗавершитьРучнуюПроверку(Результат);
        КонецЕсли;
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры

#КонецОбласти

Функция СоздатьЧерновикВТранзакции(Тест, Источник = Неопределено, НовыеЛогическиеID = Ложь)
    ОбъектТеста = Тест.ПолучитьОбъект();
    Если ОбъектТеста.Статус = Перечисления.СтатусыТестов.Архивный Тогда
        ВызватьИсключение "Архивный тест нельзя редактировать. Создайте копию теста.";
    КонецЕсли;
    Если ЗначениеЗаполнено(ОбъектТеста.РабочаяВерсия) Тогда Возврат ОбъектТеста.РабочаяВерсия; КонецЕсли;
    Если Источник = Неопределено Тогда Источник = ОбъектТеста.ОпубликованнаяВерсия; КонецЕсли;
    Версия = Справочники.ВерсииТестов.СоздатьЭлемент();
    Версия.Заполнить(Неопределено);
    Версия.Владелец = Тест;
    Версия.НомерВерсии = 1;
    Версия.НаименованиеТеста = Тест.Наименование;
    Версия.ПроходнойБаллПроцентов = 70;
    Если ЗначениеЗаполнено(Источник) Тогда
        ЗаполнитьЗначенияСвойств(Версия, Источник,
            "ОписаниеТеста,ОграничиватьВремя,ЛимитВремениМинуты,КоличествоПопыток,ПроходнойБаллПроцентов,ПеремешиватьВопросы");
        Если Не НовыеЛогическиеID Тогда
            Версия.НомерВерсии = Источник.НомерВерсии + 1;
            Версия.ПредыдущаяВерсия = Источник;
            Версия.НаименованиеТеста = Источник.НаименованиеТеста;
        КонецЕсли;
    КонецЕсли;
    Версия.Наименование = Лев(Версия.НаименованиеТеста + " / " + Строка(Версия.НомерВерсии), 150);
    Версия.Записать();
    Если ЗначениеЗаполнено(Источник) Тогда
        Вопросы = Справочники.ВопросыВерсийТестов.Выбрать(, Источник);
        Пока Вопросы.Следующий() Цикл
            Если Вопросы.ПометкаУдаления Тогда Продолжить; КонецЕсли;
            Вопрос = Справочники.ВопросыВерсийТестов.СоздатьЭлемент();
            ЗаполнитьЗначенияСвойств(Вопрос, Вопросы,
                "ПорядокВВерсии,ТекстВопроса,ТипОтвета,МаксимальныйБалл,СпособПроверки,ЭталонныйОтвет,УчитыватьРегистр,ОбрезатьПробелыПоКраям,СхлопыватьПовторныеПробелы");
            Вопрос.Владелец = Версия.Ссылка;
            Вопрос.Наименование = Лев(Строка(Вопрос.ТекстВопроса), 150);
            Если Не НовыеЛогическиеID Тогда Вопрос.ИдентификаторВопроса = Вопросы.ИдентификаторВопроса; КонецЕсли;
            Вопрос.Записать();
            Варианты = Справочники.ВариантыОтветовВерсий.Выбрать(, Вопросы.Ссылка);
            Пока Варианты.Следующий() Цикл
                Если Варианты.ПометкаУдаления Тогда Продолжить; КонецЕсли;
                Вариант = Справочники.ВариантыОтветовВерсий.СоздатьЭлемент();
                ЗаполнитьЗначенияСвойств(Вариант, Варианты, "Порядок,ТекстВарианта,Правильный");
                Вариант.Владелец = Вопрос.Ссылка;
                Вариант.Наименование = Лев(Строка(Вариант.ТекстВарианта), 150);
                Если Не НовыеЛогическиеID Тогда Вариант.ИдентификаторВарианта = Варианты.ИдентификаторВарианта; КонецЕсли;
                Вариант.Записать();
            КонецЦикла;
        КонецЦикла;
    КонецЕсли;
    ОбъектТеста.РабочаяВерсия = Версия.Ссылка;
    ОбъектТеста.Записать();
    Возврат Версия.Ссылка;
КонецФункции
